---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsShowUpText
source: html/ca24b7be-04d4-6ca7-7ef8-fa0c4d8a189f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsShowUpText Property

"Show Up Text"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsShowUpText { get; }
```